In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.387537 -1.146878
1    a  two  0.674270  0.303570
2    b  one  0.725857  1.472340
3    b  two -0.633567  1.436083
4    a  one -0.457813 -1.144939

In [2]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [3]:
grouped.mean()

key1
a   -0.057027
b    0.046145
Name: data1, dtype: float64

In [4]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.422675
      two     0.674270
b     one     0.725857
      two    -0.633567
Name: data1, dtype: float64

In [5]:
means.unstack()

key2       one       two
key1
a    -0.422675  0.674270
b     0.725857 -0.633567

In [6]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.674270
            2006    0.725857
Ohio        2005   -0.510552
            2006   -0.457813
Name: data1, dtype: float64

In [7]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.057027 -0.662749
b     0.046145  1.454212

In [8]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.422675 -1.145908
     two   0.674270  0.303570
b    one   0.725857  1.472340
     two  -0.633567  1.436083

In [9]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [10]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.387537 -1.146878
1    a  two  0.674270  0.303570
4    a  one -0.457813 -1.144939
b
  key1 key2     data1     data2
2    b  one  0.725857  1.472340
3    b  two -0.633567  1.436083

In [11]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one -0.387537 -1.146878
4    a  one -0.457813 -1.144939
a two
  key1 key2    data1    data2
1    a  two  0.67427  0.30357
b one
  key1 key2     data1    data2
2    b  one  0.725857  1.47234
b two
  key1 key2     data1     data2
3    b  two -0.633567  1.436083

In [14]:
pieces=dict(list(df.groupby('key1')))

In [15]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.725857  1.472340
3    b  two -0.633567  1.436083

In [16]:
grouped = df.groupby(df.dtypes, axis=1)
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.387537 -1.146878
1  0.674270  0.303570
2  0.725857  1.472340
3 -0.633567  1.436083
4 -0.457813 -1.144939
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one